In [26]:
%load_ext sql
%sql postgresql://admin:admin@db:5432/company

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'postgresql://admin:***@db:5432/company'

In [27]:
%%sql

DROP TABLE IF EXISTS ex_employee;

CREATE TABLE IF NOT EXISTS ex_employee (
    employee_id	INT primary key,
    first_name VARCHAR(20) NOT NULL,
    last_name VARCHAR(20) NOT NULL,
    email VARCHAR(100) UNIQUE,
    department VARCHAR(20),
    salary NUMERIC(10, 2),
    joining_date TEXT,
    age INT
);

SELECT * FROM ex_employee;

Running query in 'postgresql://admin:***@db:5432/company'

+-------------+------------+-----------+-------+------------+--------+--------------+-----+
| employee_id | first_name | last_name | email | department | salary | joining_date | age |
+-------------+------------+-----------+-------+------------+--------+--------------+-----+
+-------------+------------+-----------+-------+------------+--------+--------------+-----+

In [28]:
%%sql
-- use `/copy` if using jupyter notebook, but since we are using docker, we have to past the .csv file inside postgreSQL itself
copy ex_employee(
  employee_id,
  first_name,
  last_name,
  email,
  department,
  salary,
  joining_date,
  age
)
FROM '/csv/employee_data.csv'
DELIMITER ','
CSV HEADER;

Running query in 'postgresql://admin:***@db:5432/company'

1000 rows affected.

++
||
++
++

In [29]:
%%sql
SELECT * FROM ex_employee;

Running query in 'postgresql://admin:***@db:5432/company'

1000 rows affected.

+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |          email          | department |  salary  | joining_date | age |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
|      1      |   Joshua   |   Ramos   |  alexandra29@gmail.com  | Operations | 65313.80 |  23-05-2024  |  42 |
|      2      | Christina  |   Clark   |   littlekyle@yahoo.com  |     IT     | 58827.32 |  02-10-2021  |  46 |
|      3      |  Jonathon  |  Sullivan |  tannerivan@johnson.com | Operations | 57427.31 |  30-04-2020  |  50 |
|      4      |  Clinton   |  Aguirre  |  jamieortega@yahoo.com  |     HR     | 45352.74 |  04-04-2021  |  55 |
|      5      |  Veronica  |   Weber   | trevinosteven@ramos.com | Operations | 78772.56 |  06-10-2020  |  51 |
|      6      |   Louis    |   Rivera  |    parksamy@gmail.com   |  Finance   | 30448.72 |  05-05-2020  |  41 |
|      7      |  Sabrina   |  Gonzalez | rwillis@mason-clark.biz | Marketing  | 88476.72 |  15-10-2020  |  48 |
|      8      |  Jillian   |   Lewis   | sreese@mclean-baker.net | Marketing  | 49895.55 |  08-06-2021  |  33 |
|      9      |  Caroline  |  Kennedy  |    inguyen@huynh.com    |  Finance   | 88878.64 |  17-07-2024  |  47 |
|      10     |    Adam    |  Sanchez  |  luisclark@hotmail.com  |     HR     | 88331.24 |  23-03-2020  |  38 |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.

In [30]:
%%sql
UPDATE ex_employee
SET joining_date = TO_CHAR(
    TO_DATE(joining_date, 'DD-MM-YYYY'),
    'YYYY-MM-DD'
);

Running query in 'postgresql://admin:***@db:5432/company'

1000 rows affected.

++
||
++
++

In [31]:
%%sql
SELECT * FROM ex_employee;

Running query in 'postgresql://admin:***@db:5432/company'

1000 rows affected.

+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |          email          | department |  salary  | joining_date | age |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
|     324     |  Vanessa   |  Jackson  |     qhood@yahoo.com     |     HR     | 69330.56 |  2022-05-09  |  59 |
|     394     |   Penny    |   Ingram  |  salinassara@yahoo.com  |     HR     | 96482.00 |  2020-12-12  |  43 |
|     639     |  Matthew   |  Mcdonald |     lwebb@patel.com     |     IT     | 97416.22 |  2022-09-02  |  46 |
|      1      |   Joshua   |   Ramos   |  alexandra29@gmail.com  | Operations | 65313.80 |  2024-05-23  |  42 |
|      2      | Christina  |   Clark   |   littlekyle@yahoo.com  |     IT     | 58827.32 |  2021-10-02  |  46 |
|      3      |  Jonathon  |  Sullivan |  tannerivan@johnson.com | Operations | 57427.31 |  2020-04-30  |  50 |
|      4      |  Clinton   |  Aguirre  |  jamieortega@yahoo.com  |     HR     | 45352.74 |  2021-04-04  |  55 |
|      5      |  Veronica  |   Weber   | trevinosteven@ramos.com | Operations | 78772.56 |  2020-10-06  |  51 |
|      6      |   Louis    |   Rivera  |    parksamy@gmail.com   |  Finance   | 30448.72 |  2020-05-05  |  41 |
|      7      |  Sabrina   |  Gonzalez | rwillis@mason-clark.biz | Marketing  | 88476.72 |  2020-10-15  |  48 |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.

In [32]:
%%sql
ALTER TABLE ex_employee
ALTER COLUMN joining_date TYPE DATE USING joining_date::date;

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [33]:
%%sql
SELECT * FROM ex_employee;

Running query in 'postgresql://admin:***@db:5432/company'

1000 rows affected.

+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |          email          | department |  salary  | joining_date | age |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
|     324     |  Vanessa   |  Jackson  |     qhood@yahoo.com     |     HR     | 69330.56 |  2022-05-09  |  59 |
|     394     |   Penny    |   Ingram  |  salinassara@yahoo.com  |     HR     | 96482.00 |  2020-12-12  |  43 |
|     639     |  Matthew   |  Mcdonald |     lwebb@patel.com     |     IT     | 97416.22 |  2022-09-02  |  46 |
|      1      |   Joshua   |   Ramos   |  alexandra29@gmail.com  | Operations | 65313.80 |  2024-05-23  |  42 |
|      2      | Christina  |   Clark   |   littlekyle@yahoo.com  |     IT     | 58827.32 |  2021-10-02  |  46 |
|      3      |  Jonathon  |  Sullivan |  tannerivan@johnson.com | Operations | 57427.31 |  2020-04-30  |  50 |
|      4      |  Clinton   |  Aguirre  |  jamieortega@yahoo.com  |     HR     | 45352.74 |  2021-04-04  |  55 |
|      5      |  Veronica  |   Weber   | trevinosteven@ramos.com | Operations | 78772.56 |  2020-10-06  |  51 |
|      6      |   Louis    |   Rivera  |    parksamy@gmail.com   |  Finance   | 30448.72 |  2020-05-05  |  41 |
|      7      |  Sabrina   |  Gonzalez | rwillis@mason-clark.biz | Marketing  | 88476.72 |  2020-10-15  |  48 |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.

In [34]:
%%sql
SELECT * FROM ex_employee WHERE joining_date > '2022-01-01';

Running query in 'postgresql://admin:***@db:5432/company'

575 rows affected.

+-------------+------------+-----------+---------------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |              email              | department |  salary  | joining_date | age |
+-------------+------------+-----------+---------------------------------+------------+----------+--------------+-----+
|     324     |  Vanessa   |  Jackson  |         qhood@yahoo.com         |     HR     | 69330.56 |  2022-05-09  |  59 |
|     639     |  Matthew   |  Mcdonald |         lwebb@patel.com         |     IT     | 97416.22 |  2022-09-02  |  46 |
|      1      |   Joshua   |   Ramos   |      alexandra29@gmail.com      | Operations | 65313.80 |  2024-05-23  |  42 |
|      9      |  Caroline  |  Kennedy  |        inguyen@huynh.com        |  Finance   | 88878.64 |  2024-07-17  |  47 |
|      12     |   Hannah   |  Carrillo |     dianeroberts@becker.com     | Operations | 82047.41 |  2024-05-13  |  59 |
|      13     | Elizabeth  |  Johnson  |    ramirezbriana@hotmail.com    |     IT     | 83585.45 |  2023-12-11  |  27 |
|      14     |   Victor   |    Lamb   |     michellebrown@finley.com    |  Finance   | 55038.09 |  2024-10-29  |  56 |
|      17     |   Carla    |   Melton  | nicholas84@johnson-phillips.com |  Finance   | 41986.90 |  2024-11-08  |  28 |
|      18     |   Robert   |  Sullivan |    millerallison@hotmail.com    |  Finance   | 72896.95 |  2024-06-09  |  46 |
|      20     |  Kristina  |   Rivera  |     fbrooks@martin-blair.com    |     IT     | 85703.19 |  2022-12-18  |  59 |
+-------------+------------+-----------+---------------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.